# ĐỒ ÁN THỰC HÀNH

# A. Thu nhập dữ liệu
1. Chủ đề của dữ liệu là gì và được lấy từ nguồn nào?
- Tên chủ đề: Mức lương cho công việc Khoa học Dữ liệu (Data Science Job Salaries).
- Nguồn dữ liệu: [tại đây](https://salaries.ai-jobs.net/)
2. Tác giả có cho phép sử dụng dữ liệu này không?
- Toàn bộ bộ dữ liệu được công bố trong phạm vi công cộng theo giấy phép CC0 (Public Domain).
3. Tác giả thu thập dữ liệu như thế nào?
- Trang web cung cấp cho người dùng một biểu mẫu ngắn để trả lời khảo sát về công việc và mức lương hiện tại trong lĩnh vực Khoa học dữ liệu

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# B. Khám phá dữ liệu

## 1. Đọc dữ liệu

In [2]:
df = pd.read_csv("./data/salaries.csv")
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Data Modeler,258700,USD,258700,US,0,US,M
1,2023,SE,FT,Data Modeler,146600,USD,146600,US,0,US,M
2,2023,MI,FT,Data Science Manager,190000,USD,190000,US,100,US,M
3,2023,MI,FT,Data Science Manager,160000,USD,160000,US,100,US,M
4,2023,EN,FT,Research Analyst,90000,USD,90000,US,100,US,M

## 2. Kích thước dữ liệu

In [3]:
num_rows, num_cols = df.shape
print("Số dòng:", num_rows)
print("Số cột:", num_cols)

Số dòng: 10456
Số cột: 11

## 3. Ý nghĩa từng dòng dữ liệu
- Mỗi dòng dữ liệu là thông tin về công ty và công việc của người khảo sát.

## 4. Dữ liệu có các dòng bị lặp không?

In [4]:
have_duplicate_rows = df.duplicated().any()
have_duplicate_rows

True

## 5. Ý nghĩa từng cột dữ liệu

In [5]:
print(f"Dữ liệu có {len(df.columns)} cột")
print("Ý nghĩa các cột:\n", list(df.columns))

Dữ liệu có 11 cột
Ý nghĩa các cột:
 ['work_year', 'experience_level', 'employment_type', 'job_title', 'salary', 'salary_currency', 'salary_in_usd', 'employee_residence', 'remote_ratio', 'company_location', 'company_size']

## 6. Kiểu dữ liệu của mỗi cột dữ liệu. Có cột nào có kiểu dữ liệu không phù hợp không?

In [6]:
df.dtypes

work_year              int64
experience_level      object
employment_type       object
job_title             object
salary                 int64
salary_currency       object
salary_in_usd          int64
employee_residence    object
remote_ratio           int64
company_location      object
company_size          object
dtype: object

- Các thuộc tính của tập dữ liệu đa phần đã ở định dạng phù hợp.

## 7. Với mỗi cột mang giá trị số, các giá trị được phân bố như thế nào?

In [7]:
numerical_df = df.select_dtypes(include=["int64", "float64"])
numerical_df.head()

   work_year  salary  salary_in_usd  remote_ratio
0       2023  258700         258700             0
1       2023  146600         146600             0
2       2023  190000         190000           100
3       2023  160000         160000           100
4       2023   90000          90000           100

### 7.1. Phần trăm giá trị còn thiếu là bao nhiêu?

In [8]:
numerical_df_null = (numerical_df.isnull().sum() / len(df)) * 100

print("Tỷ lệ phần trăm giá trị thiếu cho mỗi thuộc tính số:")
print(numerical_df_null)

Tỷ lệ phần trăm giá trị thiếu cho mỗi thuộc tính số:
work_year        0.0
salary           0.0
salary_in_usd    0.0
remote_ratio     0.0
dtype: float64

### 7.2. Giá trị nhỏ nhất? Giá trị lớn nhất? Các giá trị này có gì bất thường không?

In [9]:
numerical_df.describe()

          work_year        salary  salary_in_usd  remote_ratio
count  10456.000000  1.045600e+04   10456.000000   10456.00000
mean    2022.778883  1.704655e+05  149263.499904      36.49101
std        0.506937  4.195989e+05   65269.393738      47.58074
min     2020.000000  1.400000e+04   15000.000000       0.00000
25%     2023.000000  1.050000e+05  104640.250000       0.00000
50%     2023.000000  1.430000e+05  142200.000000       0.00000
75%     2023.000000  1.882750e+05  185900.000000     100.00000
max     2023.000000  3.040000e+07  750000.000000     100.00000

- Các giá trị không có gì là bất thường.

## 8. Với mỗi cột mang giá trị phân loại, các giá trị được phân bố như thế nào?

In [10]:
categorical_df = df.select_dtypes(exclude=["int64", "float64"])
categorical_df.head()

,experience_level,employment_type,job_title,salary_currency,employee_residence,company_location,company_size
0,SE,FT,Data Modeler,USD,US,US,M
1,SE,FT,Data Modeler,USD,US,US,M
2,MI,FT,Data Science Manager,USD,US,US,M
3,MI,FT,Data Science Manager,USD,US,US,M
4,EN,FT,Research Analyst,USD,US,US,M

### 8.1. Phần trăm giá trị còn thiếu là bao nhiêu?

In [11]:
categorical_df_null = (categorical_df.isnull().sum() / len(df)) * 100

print("Tỷ lệ phần trăm giá trị thiếu cho mỗi thuộc tính phân loại:")
print(categorical_df_null)

Tỷ lệ phần trăm giá trị thiếu cho mỗi thuộc tính phân loại:
experience_level      0.0
employment_type       0.0
job_title             0.0
salary_currency       0.0
employee_residence    0.0
company_location      0.0
company_size          0.0
dtype: float64

### 8.2. Mỗi cột có bao nhiêu giá trị khác nhau?

In [12]:
for column in categorical_df.columns:
    unique_values = categorical_df[column].unique()
    print(f"+ Cột {column}: {unique_values}")

+ Cột experience_level: ['SE' 'MI' 'EN' 'EX']
+ Cột employment_type: ['FT' 'PT' 'CT' 'FL']
+ Cột job_title: ['Data Modeler' 'Data Science Manager' 'Research Analyst' 'Data Engineer'
 'Data Analyst' 'ETL Developer' 'Machine Learning Engineer'
 'Data Scientist' 'Data Specialist' 'Data Strategist' 'Prompt Engineer'
 'Business Intelligence Developer' 'Research Engineer'
 'Business Intelligence Analyst' 'Data Science Lead' 'ML Engineer'
 'Analytics Engineer' 'BI Developer' 'Data Quality Manager'
 'Applied Scientist' 'Head of Data' 'Research Scientist' 'Data Architect'
 'Data Science' 'Business Intelligence Engineer' 'Data Science Consultant'
 'Machine Learning Scientist' 'Data Product Manager'
 'Business Intelligence Manager' 'Data Manager' 'Data Analytics Manager'
 'Computer Vision Engineer' 'AI Product Manager' 'Data Analytics Lead'
 'Director of Data Science' 'Data Product Owner' 'Data Developer'
 'Machine Learning Infrastructure Engineer' 'Data Lead' 'AI Engineer'
 'Data Integration Engineer' 'Data Management Analyst'
 'Data Visualization Specialist' 'BI Analyst' 'Data Science Engineer'
 'Business Data Analyst' 'Machine Learning Operations Engineer'
 'Data Analyst Lead' 'NLP Engineer' 'MLOps Engineer'
 'Marketing Data Scientist' 'AI Scientist' 'Insight Analyst'
 'Data DevOps Engineer' 'Machine Learning Researcher'
 'Data Quality Analyst' 'Deep Learning Engineer' 'AI Developer'
 'Data Science Director' 'Machine Learning Modeler' 'BI Data Analyst'
 'Data Integration Specialist' 'Data Science Practitioner'
 'AI Research Engineer' 'Data Management Specialist' 'AI Architect'
 'Business Intelligence Specialist' 'Data Quality Engineer'
 'AI Programmer' 'Decision Scientist' 'Financial Data Analyst'
 'Data Strategy Manager' 'Data Visualization Engineer'
 'Azure Data Engineer' 'Principal Data Scientist' 'Staff Data Analyst'
 'Data Infrastructure Engineer' 'Machine Learning Software Engineer'
 'Head of Machine Learning' 'Applied Data Scientist'
 'Data Operations Analyst' 'Applied Machine Learning Scientist'
 'Data Operations Engineer' 'Machine Learning Manager'
 'Lead Data Scientist' 'Principal Machine Learning Engineer'
 'Principal Data Engineer' 'Power BI Developer' 'Head of Data Science'
 'Staff Machine Learning Engineer' 'Staff Data Scientist'
 'Consultant Data Engineer' 'Machine Learning Specialist'
 'Business Intelligence Data Analyst' 'Data Operations Manager'
 'Lead Machine Learning Engineer' 'Managing Director Data Science'
 'Data Modeller' 'Finance Data Analyst' 'Software Data Engineer'
 'Machine Learning Research Engineer' 'Compliance Data Analyst'
 'Data Operations Specialist' 'Cloud Data Engineer'
 'Analytics Engineering Manager' 'AWS Data Architect'
 'Product Data Analyst' 'Machine Learning Developer'
 'Data Visualization Analyst' 'Autonomous Vehicle Technician'
 'Sales Data Analyst' 'Applied Machine Learning Engineer' 'ETL Engineer'
 'Big Data Engineer' 'Lead Data Analyst' 'BI Data Engineer'
 'Cloud Database Engineer' 'Deep Learning Researcher'
 'Data Analytics Specialist' 'Big Data Architect'
 'Computer Vision Software Engineer' 'Marketing Data Engineer'
 'Manager Data Management' 'Data Analytics Consultant'
 'Data Science Tech Lead' 'Data Scientist Lead' 'Marketing Data Analyst'
 'Principal Data Architect' 'Data Analytics Engineer'
 'Cloud Data Architect' 'Lead Data Engineer' 'Principal Data Analyst']
+ Cột salary_currency: ['USD' 'EUR' 'GBP' 'CAD' 'AUD' 'INR' 'PLN' 'BRL' 'PHP' 'TRY' 'CHF' 'NOK'
 'JPY' 'ZAR' 'HKD' 'SGD' 'ILS' 'THB' 'HUF' 'DKK' 'MXN' 'CLP']
+ Cột employee_residence: ['US' 'DE' 'GB' 'ZA' 'AU' 'CA' 'NZ' 'HU' 'IN' 'ES' 'VN' 'NG' 'PH' 'IE'
 'PL' 'FR' 'CZ' 'NL' 'PK' 'UA' 'LT' 'PT' 'UG' 'CO' 'IT' 'SI' 'RO' 'GR'
 'LV' 'MU' 'AM' 'HR' 'TH' 'KR' 'EE' 'TR' 'BR' 'QA' 'RU' 'KE' 'TN' 'GH'
 'BE' 'CH' 'AD' 'EC' 'PE' 'MX' 'MD' 'SA' 'NO' 'AR' 'EG' 'UZ' 'GE' 'JP'
 'HK' 'CF' 'FI' 'IL' 'AT' 'SG' 'SE' 'KW' 'CY' 'BA' 'IR' 'AS' 'CN' 'CR'
 'CL' 'PR' 'DK' 'BO' 'DO' 'ID' 'AE' 'MY' 'HN' 'DZ' 'IQ' 'BG' 'JE' 'RS'
 'LU' 'MT']
+ Cột company_location: ['US' 'DE' 'GB' 'ZA' 'AU' 'CA' 'NZ' 'HU' 'IN' 'ES' 'VN' 'NG' 'PH' 'IE'
 'PL' 'FR' 'NL' 'LU' 'LT' 'PT' 'GI' 'CO' 'UA' 'SI' 'RO' 'GR' 'LV' 'MU'
 'RU' 'IT' 'KR' 'EE' 'CZ' 'CH' 'BR' 'QA' 'KE' 'DK' 'GH' 'SE' 'TR' 'AD'
 'EC' 'MX' 'IL' 'SA' 'NO' 'AR' 'JP' 'HK' 'CF' 'FI' 'SG' 'TH' 'HR' 'AM'
 'BA' 'PK' 'IR' 'BS' 'AT' 'PR' 'AS' 'BE' 'ID' 'EG' 'AE' 'MY' 'HN' 'DZ'
 'IQ' 'CN' 'CL' 'MD' 'MT']
+ Cột company_size: ['M' 'L' 'S']

### 8.3. Các giá trị này có gì bất thường không?
- Các giá trị không có gì là bất thường.

# C. Đưa ra câu hỏi có ý nghĩa và trả lời câu hỏi